tests/unit/api_contract/_api_checker/test_payment_plans_global/payment_plan.fixture.json

{
    "payment_plan": {
        "master": {
            "model": "payment.paymentplan",
            "pk": "89198b97-1b9b-415c-b6fe-953a13922a68",
            "fields": {
                "is_removed": false,
                "created_at": "2026-02-03T12:12:42.490Z",
                "updated_at": "2026-02-03T12:12:42.493Z",
                "version": 1770119815808417,
                "unicef_id": "PP-BA0002-26-00000001",
                "internal_data": {},
                "business_area": "d79b77f6-3c50-4cfc-be3f-c8335f58c04d",
                "program_cycle": "4ce1718f-cc69-4216-a227-d8417980ed54",
                "delivery_mechanism": null,
                "financial_service_provider": null,
                "imported_file": null,
                "export_file_entitlement": null,
                "export_file_per_fsp": null,
                "export_pdf_file_summary": null,
                "reconciliation_import_file": null,
                "steficon_rule": null,
                "steficon_rule_targeting": null,
                "created_by": "cdf9d489-1f34-4226-9f50-447e07153602",
                "source_payment_plan": null,
                "storage_file": null,
                "name": null,
                "start_date": null,
                "end_date": null,
                "currency": null,
                "dispersion_start_date": "2026-02-03",
                "dispersion_end_date": "2026-03-05",
                "excluded_ids": null,
                "exclusion_reason": null,
                "vulnerability_score_min": null,
                "vulnerability_score_max": null,
                "abort_comment": "",
                "status": "OPEN",
                "background_action_status": null,
                "build_status": null,
                "built_at": null,
                "exchange_rate": null,
                "female_children_count": 0,
                "male_children_count": 0,
                "female_adults_count": 0,
                "male_adults_count": 0,
                "total_households_count": 0,
                "total_individuals_count": 0,
                "imported_file_date": null,
                "total_entitled_quantity": null,
                "total_entitled_quantity_usd": null,
                "total_entitled_quantity_revised": null,
                "total_entitled_quantity_revised_usd": null,
                "total_delivered_quantity": null,
                "total_delivered_quantity_usd": null,
                "total_undelivered_quantity": null,
                "total_undelivered_quantity_usd": null,
                "steficon_targeting_applied_date": null,
                "steficon_applied_date": null,
                "is_follow_up": false,
                "exclude_household_error": null,
                "status_date": "2026-02-03T12:12:42.489Z",
                "is_cash_assist": false,
                "flag_exclude_if_active_adjudication_ticket": false,
                "flag_exclude_if_on_sanction_list": false
            }
        },
        "deps": [
            {
                "model": "core.businessarea",
                "pk": "d79b77f6-3c50-4cfc-be3f-c8335f58c04d",
                "fields": {
                    "created_at": "2026-02-03T12:12:42.378Z",
                    "updated_at": "2026-02-03T12:12:42.378Z",
                    "code": "BA0002",
                    "slug": "business-area-2",
                    "name": "Business Area 2",
                    "long_name": "Business Area 2 Long Name",
                    "parent": null,
                    "office_country": null,
                    "is_split": false,
                    "region_code": "64",
                    "region_name": "TEST",
                    "has_data_sharing_agreement": false,
                    "is_accountability_applicable": false,
                    "rdi_import_xlsx_disabled": false,
                    "active": true,
                    "enable_email_notification": true,
                    "kobo_username": null,
                    "kobo_token": null,
                    "kobo_url": null,
                    "rapid_pro_host": null,
                    "rapid_pro_payment_verification_token": null,
                    "rapid_pro_messages_token": null,
                    "rapid_pro_survey_token": null,
                    "postpone_deduplication": false,
                    "deduplication_duplicate_score": 6.0,
                    "deduplication_possible_duplicate_score": 6.0,
                    "deduplication_batch_duplicates_percentage": 50,
                    "deduplication_batch_duplicates_allowed": 5,
                    "deduplication_golden_record_duplicates_percentage": 50,
                    "deduplication_golden_record_duplicates_allowed": 5,
                    "deduplication_ignore_withdraw": false,
                    "biometric_deduplication_threshold": 0.0,
                    "custom_fields": {},
                    "countries": [],
                    "payment_countries": []
                }
            },
            {
                "model": "program.programcycle",
                "pk": "4ce1718f-cc69-4216-a227-d8417980ed54",
                "fields": {
                    "created_at": "2026-02-03T12:12:42.488Z",
                    "updated_at": "2026-02-03T12:12:42.488Z",
                    "version": 1770119815803430,
                    "unicef_id": "PC-BA0002-26-000001",
                    "title": "Default Programme Cycle",
                    "program": "0fff9483-092a-45ed-b94a-7aee65dd8a25",
                    "status": "ACTIVE",
                    "start_date": "2026-02-03",
                    "end_date": null,
                    "created_by": null
                }
            },
            {
                "model": "program.program",
                "pk": "0fff9483-092a-45ed-b94a-7aee65dd8a25",
                "fields": {
                    "is_removed": false,
                    "created_at": "2026-02-03T12:12:42.409Z",
                    "updated_at": "2026-02-03T12:12:42.409Z",
                    "last_sync_at": null,
                    "version": 1770119815753175,
                    "data_collecting_type": 3,
                    "beneficiary_group": "5765e5c2-172c-4bab-afdb-8b99f857990a",
                    "business_area": "d79b77f6-3c50-4cfc-be3f-c8335f58c04d",
                    "name": "Program 2",
                    "programme_code": "3YD7",
                    "status": "ACTIVE",
                    "slug": "3yd7",
                    "description": "",
                    "start_date": "2026-02-03",
                    "end_date": "2027-02-03",
                    "sector": "MULTI_PURPOSE",
                    "budget": "1000000.00",
                    "frequency_of_payments": "ONE_OFF",
                    "scope": null,
                    "partner_access": "SELECTED_PARTNERS_ACCESS",
                    "cash_plus": false,
                    "population_goal": 1000,
                    "administrative_areas_of_implementation": "",
                    "biometric_deduplication_enabled": false,
                    "collision_detector": "hope.apps.program.collision_detectors.NoopCollisionDetector",
                    "is_visible": true,
                    "household_count": 0,
                    "individual_count": 0,
                    "reconciliation_window_in_days": 0,
                    "send_reconciliation_window_expiry_notifications": false,
                    "admin_areas": [],
                    "sanction_lists": []
                }
            },
            {
                "model": "core.datacollectingtype",
                "pk": 3,
                "fields": {
                    "created": "2026-02-03T12:12:42.402Z",
                    "modified": "2026-02-03T12:12:42.402Z",
                    "code": "dct_2",
                    "label": "DCT 2",
                    "type": "STANDARD",
                    "description": "",
                    "active": true,
                    "deprecated": false,
                    "individual_filters_available": false,
                    "household_filters_available": true,
                    "recalculate_composition": false,
                    "weight": 0,
                    "compatible_types": [
                        3
                    ],
                    "limit_to": []
                }
            },
            {
                "model": "program.beneficiarygroup",
                "pk": "5765e5c2-172c-4bab-afdb-8b99f857990a",
                "fields": {
                    "created_at": "2026-02-03T12:12:42.405Z",
                    "updated_at": "2026-02-03T12:12:42.405Z",
                    "name": "Group 2",
                    "group_label": "Household",
                    "group_label_plural": "Households",
                    "member_label": "Individual",
                    "member_label_plural": "Individuals",
                    "master_detail": true
                }
            },
            {
                "model": "account.user",
                "pk": "cdf9d489-1f34-4226-9f50-447e07153602",
                "fields": {
                    "password": "",
                    "last_login": null,
                    "is_superuser": true,
                    "username": "user_4",
                    "first_name": "",
                    "last_name": "",
                    "is_staff": true,
                    "is_active": true,
                    "date_joined": "2026-02-03T12:12:42.360Z",
                    "azure_id": null,
                    "display_name": "user_4",
                    "status": "INVITED",
                    "partner": 9,
                    "email": "user_4@example.com",
                    "custom_fields": {},
                    "job_title": "",
                    "last_modify_date": "2026-02-03T12:12:42.485Z",
                    "groups": [],
                    "user_permissions": []
                }
            },
            {
                "model": "account.partner",
                "pk": 9,
                "fields": {
                    "name": "Partner 4",
                    "parent": null,
                    "is_un": false,
                    "lft": 1,
                    "rght": 2,
                    "tree_id": 2,
                    "level": 0,
                    "allowed_business_areas": []
                }
            }
        ]
    }
}
